In [2]:
import pandas as pd
import numpy as np

In [5]:
# Arithmetic methods with fill values

In [6]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                  columns=list('abcd'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [7]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                  columns=list('abcde'))
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [8]:
df2.loc[1, 'b'] = np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [9]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [10]:
# adding with fill values
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [11]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [12]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [13]:
2/df1

      a         b         c         d
0   inf  2.000000  1.000000  0.666667
1  0.50  0.400000  0.333333  0.285714
2  0.25  0.222222  0.200000  0.181818

In [14]:
df1.rdiv(2)

      a         b         c         d
0   inf  2.000000  1.000000  0.666667
1  0.50  0.400000  0.333333  0.285714
2  0.25  0.222222  0.200000  0.181818

In [15]:
# operation between dataframe and series

In [16]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                    columns = list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [17]:
series = frame.iloc[0]

In [18]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [19]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [21]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [22]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [23]:
series3 =  frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [24]:
frame.sub(series3, axis='index') # broadcast row

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [26]:
series4 = frame.iloc[0]
series4

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [27]:
frame.sub(series4, axis='columns')

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [1]:
# Function application and mapping// numpy ufunc also work with padas object

In [3]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    0.902361  0.785588 -0.452587
Ohio   -0.235073 -0.512061  0.049031
Texas   0.359456 -0.496452  0.677719
Oregon  0.119658 -0.016304  1.141446

In [4]:
np.abs(frame)

               b         d         e
Utah    0.902361  0.785588  0.452587
Ohio    0.235073  0.512061  0.049031
Texas   0.359456  0.496452  0.677719
Oregon  0.119658  0.016304  1.141446

In [5]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    1.137435
d    1.297649
e    1.594033
dtype: float64

In [6]:
frame.apply(f, axis='columns')

Utah      1.354948
Ohio      0.561092
Texas     1.174171
Oregon    1.157749
dtype: float64

In [7]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -0.235073 -0.512061 -0.452587
max  0.902361  0.785588  1.141446

In [8]:
# element wise python functions

In [10]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah     0.90   0.79  -0.45
Ohio    -0.24  -0.51   0.05
Texas    0.36  -0.50   0.68
Oregon   0.12  -0.02   1.14

In [13]:
df = pd.DataFrame(np.random.random((4,3)), columns=list('abc'),
                 index=['Kathmandu', 'Chitwan', 'Pokhara', 'Biratnagar'])
df

                   a         b         c
Kathmandu   0.597076  0.954629  0.198802
Chitwan     0.357241  0.976253  0.795331
Pokhara     0.733577  0.329076  0.767638
Biratnagar  0.511404  0.024539  0.045920

In [16]:
format = lambda x: x * x
df.applymap(format)

                   a         b         c
Kathmandu   0.356500  0.911317  0.039522
Chitwan     0.127621  0.953069  0.632551
Pokhara     0.538135  0.108291  0.589268
Biratnagar  0.261534  0.000602  0.002109

In [20]:
format = lambda x : x - x
df.applymap(format)

              a    b    c
Kathmandu   0.0  0.0  0.0
Chitwan     0.0  0.0  0.0
Pokhara     0.0  0.0  0.0
Biratnagar  0.0  0.0  0.0

In [4]:
# Sorting And Ranking
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj
# sort the index
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [3]:
# with dataframe
df = pd.DataFrame(np.arange(8).reshape((2, 4)),
                 index=['three', 'one'],
                 columns=['d', 'a', 'b', 'c'])
df

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [4]:
df.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [8]:
df.sort_index(axis='columns')

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [10]:
# to sort in descending order
df.sort_index(axis='columns', ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [12]:
df.sort_index(ascending=False)

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [13]:
# to sort values of series
obj = pd.Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [14]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [15]:
obj2 = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj2.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [16]:
# dataframe
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [18]:
frame.sort_values(by='b') # sorting column b

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [20]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [21]:
# Ranking : ->

In [3]:
obj = pd.Series([10, -5, 7, 4, 2, 0, 4])
obj

0    10
1    -5
2     7
3     4
4     2
5     0
6     4
dtype: int64

In [4]:
obj.rank()

0    7.0
1    1.0
2    6.0
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [5]:
obj.rank(method='first')

0    7.0
1    1.0
2    6.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [6]:
# assign tie values the maximum rank in the group
obj.rank(ascending=False, method='max')

0    1.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [5]:
# in dataframe
df = pd.DataFrame({'b': [4.3, 7, -3, 2],
                   'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
df

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [6]:
df.rank() # colummn rank. method='max'

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

In [10]:
df.rank(method='min', axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [9]:
df.rank(method='first')

     b    a    c
0  3.0  1.0  2.0
1  4.0  3.0  3.0
2  1.0  2.0  4.0
3  2.0  4.0  1.0